app/controllers/users_controller.rb

  def search
   if @query=params[:query]
    @users=User.where("users.email LIKE ? OR pincode LIKE ? OR first_name LIKE ? OR last_name LIKE ?",["%#{@query}%"],["%#{@query}%"],["%#{@query}%"],["%#{@query}%"])
---
SELECT "users".* FROM "users" WHERE (users.email LIKE '%jitendra%' OR pincode LIKE '%jitendra%' OR first_name LIKE '%jitendra%' OR last_name LIKE '%jitendra%')

  def create
    @user =User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone_number", "date_of_birth", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "pincode" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pincode", 781029], ["updated_at", "2021-09-20 12:37:01.998608"], ["id", 16]]